; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p13---int100n150-m25---int100c110---s327---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level16 level16)
(sum level0 level22 level22)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level16 level17)
(sum level1 level22 level23)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level16 level18)
(sum level2 level22 level24)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level16 level19)
(sum level3 level22 level25)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level16 level20)
(sum level4 level22 level26)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level16 level21)
(sum level5 level22 level27)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level16 level22)
(sum level6 level22 level28)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level16 level23)
(sum level7 level22 level29)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level16 level24)
(sum level8 level22 level30)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level16 level25)
(sum level9 level22 level31)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level16 level26)
(sum level10 level22 level32)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level16 level27)
(sum level11 level22 level33)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level16 level28)
(sum level12 level22 level34)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level16 level29)
(sum level13 level22 level35)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level16 level30)
(sum level14 level22 level36)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level16 level31)
(sum level15 level22 level37)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level16 level32)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level16 level33)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level16 level34)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level16 level35)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level16 level36)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level16 level37)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level5 level37)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level36 level1 level37)

(connected l0 l1)
(fuelcost level6 l0 l1)
(connected l0 l2)
(fuelcost level22 l0 l2)
(connected l0 l3)
(fuelcost level25 l0 l3)
(connected l0 l4)
(fuelcost level1 l0 l4)
(connected l1 l0)
(fuelcost level6 l1 l0)
(connected l1 l5)
(fuelcost level16 l1 l5)
(connected l2 l0)
(fuelcost level22 l2 l0)
(connected l2 l5)
(fuelcost level5 l2 l5)
(connected l3 l0)
(fuelcost level25 l3 l0)
(connected l3 l4)
(fuelcost level2 l3 l4)
(connected l3 l5)
(fuelcost level22 l3 l5)
(connected l4 l0)
(fuelcost level1 l4 l0)
(connected l4 l3)
(fuelcost level2 l4 l3)
(connected l4 l5)
(fuelcost level3 l4 l5)
(connected l5 l1)
(fuelcost level16 l5 l1)
(connected l5 l2)
(fuelcost level5 l5 l2)
(connected l5 l3)
(fuelcost level22 l5 l3)
(connected l5 l4)
(fuelcost level3 l5 l4)

(at t0 l1)
(fuel t0 level37)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l1)
(at p3 l1)
(at p4 l0)
(at p5 l2)
(at p6 l0)
(at p7 l5)
(at p8 l4)
(at p9 l0)
(at p10 l3)
(at p11 l1)
(at p12 l5)
)

(:goal
(and
(at p0 l4)
(at p1 l0)
(at p2 l3)
(at p3 l4)
(at p4 l5)
(at p5 l1)
(at p6 l4)
(at p7 l1)
(at p8 l1)
(at p9 l2)
(at p10 l5)
(at p11 l3)
(at p12 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 13
2. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 13
3. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 0 of 13
4. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 13
5. (drive t0 l1 l0 level31 level6 level37)
   deleted: (at t0 l1) (fuel t0 level37)
   added: (at t0 l0) (fuel t0 level31)
   goals met: 0 of 13
6. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 1 of 13
7. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 1 of 13
8. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 1 of 13
9. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 1 of 13
10. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 1 of 13
11. (drive t0 l0 l4 level30 level1 level31)
   deleted: (at t0 l0) (fuel t0 level31)
   added: (at t0 l4) (fuel t0 level30)
   goals met: 1 of 13
12. (drive t0 l4 l3 level28 level2 level30)
   deleted: (at t0 l4) (fuel t0 level30)
   added: (at t0 l3) (fuel t0 level28)
   goals met: 1 of 13
13. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 2 of 13
14. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 3 of 13
15. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 3 of 13
16. (drive t0 l3 l4 level26 level2 level28)
   deleted: (at t0 l3) (fuel t0 level28)
   added: (at t0 l4) (fuel t0 level26)
   goals met: 3 of 13
17. (drive t0 l4 l5 level23 level3 level26)
   deleted: (at t0 l4) (fuel t0 level26)
   added: (at t0 l5) (fuel t0 level23)
   goals met: 3 of 13
18. (drive t0 l5 l2 level18 level5 level23)
   deleted: (at t0 l5) (fuel t0 level23)
   added: (at t0 l2) (fuel t0 level18)
   goals met: 3 of 13
19. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 3 of 13
20. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 4 of 13
21. (drive t0 l2 l5 level13 level5 level18)
   deleted: (at t0 l2) (fuel t0 level18)
   added: (at t0 l5) (fuel t0 level13)
   goals met: 4 of 13
22. (load p12 t0 l5)
   deleted: (at p12 l5)
   added: (in p12 t0)
   goals met: 4 of 13
23. (load p7 t0 l5)
   deleted: (at p7 l5)
   added: (in p7 t0)
   goals met: 4 of 13
24. (unload p10 t0 l5)
   deleted: (in p10 t0)
   added: (at p10 l5)
   goals met: 5 of 13
25. (unload p4 t0 l5)
   deleted: (in p4 t0)
   added: (at p4 l5)
   goals met: 6 of 13
26. (drive t0 l5 l4 level10 level3 level13)
   deleted: (at t0 l5) (fuel t0 level13)
   added: (at t0 l4) (fuel t0 level10)
   goals met: 6 of 13
27. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 6 of 13
28. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 7 of 13
29. (unload p12 t0 l4)
   deleted: (in p12 t0)
   added: (at p12 l4)
   goals met: 8 of 13
30. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 9 of 13
31. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 10 of 13
32. (drive t0 l4 l0 level9 level1 level10)
   deleted: (at t0 l4) (fuel t0 level10)
   added: (at t0 l0) (fuel t0 level9)
   goals met: 10 of 13
33. (drive t0 l0 l1 level3 level6 level9)
   deleted: (at t0 l0) (fuel t0 level9)
   added: (at t0 l1) (fuel t0 level3)
   goals met: 10 of 13
34. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 11 of 13
35. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 12 of 13
36. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 13 of 13
